### DataFrame

In [1]:
import numpy as np
import pandas as pd

import datetime
from datetime import datetime, date

# pd.set_option('display.notebook_repr_html', False)
# pd.set_option('display.max_columns', 8)
# pd.set_option('display.max_rows', 10)
# pd.set_option('display.width', 80)

import matplotlib.pyplot as plt 
%matplotlib inline

In [2]:
pd.DataFrame(np.arange(1, 6))

   0
0  1
1  2
2  3
3  4
4  5

In [3]:
df = pd.DataFrame(np.array([[10, 11], [20, 21]]))
df

    0   1
0  10  11
1  20  21

In [4]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [7]:
df = pd.DataFrame(np.array([[70, 71], [90, 91]]), columns = ['Missoula', 'Philadelphia'])
df

   Missoula  Philadelphia
0        70            71
1        90            91

In [8]:
len(df)

2

In [9]:
df.shape

(2, 2)

In [10]:
temps_missoula = [70, 71]
temps_philly = [90,  91]
temperatures = {
    'Missoula' : temps_missoula,
    'Philadelphia': temps_philly
}
pd.DataFrame(temperatures)

   Missoula  Philadelphia
0        70            90
1        71            91

In [11]:
temps_at_time0 = pd.Series([70, 90])
temps_at_time1 = pd.Series([71, 91])
df = pd.DataFrame([temps_at_time0, temps_at_time1])
df

    0   1
0  70  90
1  71  91

In [12]:
df = pd.DataFrame([temps_at_time0, temps_at_time1], columns = ['Missoula', 'Philadelphia'])
df

   Missoula  Philadelphia
0       NaN           NaN
1       NaN           NaN

In [13]:
df = pd.DataFrame([temps_at_time0, temps_at_time1])
df.columns = ['Missoula', 'Philadelphia']
df

   Missoula  Philadelphia
0        70            90
1        71            91